In [2]:
import pandas as pd
import numpy as np

In [3]:
data = pd.read_csv('kiva_loans.csv')
data.head()

,id,funded_amount,loan_amount,activity,sector,use,country_code,country,region,currency,partner_id,posted_time,disbursed_time,funded_time,term_in_months,lender_count,tags,borrower_genders,repayment_interval,date
0,653051,300.0,300.0,Fruits & Vegetables,Food,"To buy seasonal, fresh fruits to sell.",PK,Pakistan,Lahore,PKR,247.0,2014-01-01 06:12:39+00:00,2013-12-17 08:00:00+00:00,2014-01-02 10:06:32+00:00,12.0,12,NaN,female,irregular,2014-01-01
1,653053,575.0,575.0,Rickshaw,Transportation,to repair and maintain the auto rickshaw used ...,PK,Pakistan,Lahore,PKR,247.0,2014-01-01 06:51:08+00:00,2013-12-17 08:00:00+00:00,2014-01-02 09:17:23+00:00,11.0,14,NaN,"female, female",irregular,2014-01-01
2,653068,150.0,150.0,Transportation,Transportation,To repair their old cycle-van and buy another ...,IN,India,Maynaguri,INR,334.0,2014-01-01 09:58:07+00:00,2013-12-17 08:00:00+00:00,2014-01-01 16:01:36+00:00,43.0,6,"user_favorite, user_favorite",female,bullet,2014-01-01
3,653063,200.0,200.0,Embroidery,Arts,to purchase an embroidery machine and a variet...,PK,Pakistan,Lahore,PKR,247.0,2014-01-01 08:03:11+00:00,2013-12-24 08:00:00+00:00,2014-01-01 13:00:00+00:00,11.0,8,NaN,female,irregular,2014-01-01
4,653084,400.0,400.0,Milk Sales,Food,to purchase one buffalo.,PK,Pakistan,Abdul Hakeem,PKR,245.0,2014-01-01 11:53:19+00:00,2013-12-17 08:00:00+00:00,2014-01-01 19:18:51+00:00,14.0,16,NaN,female,monthly,2014-01-01

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671205 entries, 0 to 671204
Data columns (total 20 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  671205 non-null  int64
 1   funded_amount       671205 non-null  float64
 2   loan_amount         671205 non-null  float64
 3   activity            671205 non-null  object
 4   sector              671205 non-null  object
 5   use                 666973 non-null  object
 6   country_code        671197 non-null  object
 7   country             671205 non-null  object
 8   region              614405 non-null  object
 9   currency            671205 non-null  object
 10  partner_id          657698 non-null  float64
 11  posted_time         671205 non-null  object
 12  disbursed_time      668809 non-null  object
 13  funded_time         622874 non-null  object
 14  term_in_months      671205 non-null  float64
 15  lender_count        671205 non-null  int64
 16  tags                499789 non-null  object
 17  borrower_genders    666984 non-null  object
 18  repayment_interval  671205 non-null  object
 19  date                671205 non-null  object
dtypes: float64(4), int64(2), object(14)
memory usage: 102.4+ MB

In [5]:
data.drop(['funded_amount', 'activity', 'use', 'country_code', 'region', 'currency', 'partner_id', 'posted_time', 'disbursed_time', 'funded_time', 'lender_count', 'tags'], axis=1, inplace=True)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 671205 entries, 0 to 671204
Data columns (total 8 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   id                  671205 non-null  int64
 1   loan_amount         671205 non-null  float64
 2   sector              671205 non-null  object
 3   country             671205 non-null  object
 4   term_in_months      671205 non-null  float64
 5   borrower_genders    666984 non-null  object
 6   repayment_interval  671205 non-null  object
 7   date                671205 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 41.0+ MB

In [7]:
data.sample(10)

,id,loan_amount,sector,country,term_in_months,borrower_genders,repayment_interval,date
317722,964518,525.0,Personal Use,Nigeria,14.0,male,bullet,2015-10-17
501823,1162757,1200.0,Agriculture,Peru,14.0,male,bullet,2016-10-04
658726,1321046,200.0,Education,Kenya,14.0,female,monthly,2017-06-16
412562,1058965,550.0,Retail,Lebanon,12.0,female,monthly,2016-04-22
451606,1111582,1275.0,Food,Cambodia,14.0,"female, female, male",monthly,2016-07-05
177436,825737,200.0,Food,Philippines,9.0,female,irregular,2015-01-09
479085,1139100,6250.0,Food,Bolivia,10.0,"female, female, female, male, female, female, ...",monthly,2016-08-24
20245,672988,2300.0,Food,Peru,6.0,"female, female, female, female, female, female...",irregular,2014-02-19
606829,1268176,250.0,Food,Kenya,8.0,female,irregular,2017-03-28
242860,889902,450.0,Food,Philippines,11.0,female,irregular,2015-05-22

In [8]:
#change data column to datetime
data['date'] = pd.to_datetime(data['date'], format='%Y-%m-%d')

In [9]:
#drop any row with a missing value
data.dropna(axis=0, how='any', inplace=True)

In [10]:
data.shape

(666984, 8)

In [11]:
#Let's look at the gender column, and clean it up
data['borrower_genders'].sample(10)

499875                                               female
303494                                               female
413552    female, male, female, female, female, female, ...
85179                                                  male
638154                                                 male
96583                                                female
447377                                                 male
32289                                                female
335762                                               female
79267                                                  male
Name: borrower_genders, dtype: object

In [12]:
data['female_gender'] = data['borrower_genders'].str.contains('female')

In [13]:
#create a gender column and encode in 'F' and 'M'
data.loc[data['female_gender'] == True, 'gender'] = 'F'
data.loc[data['female_gender'] == False, 'gender'] ='M'

In [14]:
data.drop(['borrower_genders', 'female_gender'], axis=1, inplace=True)

In [15]:
print(data['gender'].value_counts())

F    528461
M    138523
Name: gender, dtype: int64

In [16]:
#change the gender column to a category
category = ['F', 'M']
cat_dtype = pd.api.types.CategoricalDtype(categories=category, ordered=True)
data['gender'] = data['gender'].astype(cat_dtype)

print(data.gender.sample(5))

531578    M
431934    F
454649    F
161684    F
31963     F
Name: gender, dtype: category
Categories (2, object): [F < M]

In [17]:
#data.loc[data['repayment_interval'] == 'bullet'] = 'daily'
print(data['repayment_interval'].value_counts())

monthly      340171
irregular    256573
bullet        69638
weekly          602
Name: repayment_interval, dtype: int64

In [18]:
#Change the repayment_interval column to a category too.
#Directly: .astype()
data['repayment_interval'] = data['repayment_interval'].astype('category')
print(data['repayment_interval'].dtype)
print(data.repayment_interval.value_counts())

category
monthly      340171
irregular    256573
bullet        69638
weekly          602
Name: repayment_interval, dtype: int64

In [19]:
print(data.repayment_interval.sample(5))

297094    irregular
415332    irregular
238429      monthly
303523    irregular
499187      monthly
Name: repayment_interval, dtype: category
Categories (4, object): [bullet, irregular, monthly, weekly]

In [20]:
#Look at the country column:
data.country.head()

0    Pakistan
1    Pakistan
2       India
3    Pakistan
4    Pakistan
Name: country, dtype: object

In [21]:
#There's an error where instead of India, it's daily.
#What caused this error, I don't know. Yet.
#print(data.country[data['country'] == 'daily'].count())

In [22]:
#Change 'daily' to 'India' in the country column
#data.loc[data['country'] == 'daily'] = 'India'

In [23]:
#print(data.country[data['country'] == 'India'].count())
print(data.country.unique())
print(data.country.nunique())

['Pakistan' 'India' 'Kenya' 'Nicaragua' 'El Salvador' 'Tanzania'
 'Philippines' 'Peru' 'Senegal' 'Cambodia' 'Liberia' 'Vietnam' 'Iraq'
 'Honduras' 'Palestine' 'Mongolia' 'United States' 'Mali' 'Colombia'
 'Tajikistan' 'Guatemala' 'Ecuador' 'Bolivia' 'Yemen' 'Ghana'
 'Sierra Leone' 'Haiti' 'Chile' 'Jordan' 'Uganda' 'Burundi' 'Burkina Faso'
 'Timor-Leste' 'Indonesia' 'Georgia' 'Ukraine' 'Kosovo' 'Albania'
 'The Democratic Republic of the Congo' 'Costa Rica' 'Somalia' 'Zimbabwe'
 'Cameroon' 'Turkey' 'Azerbaijan' 'Dominican Republic' 'Brazil' 'Mexico'
 'Kyrgyzstan' 'Armenia' 'Paraguay' 'Lebanon' 'Samoa' 'Israel' 'Rwanda'
 'Zambia' 'Nepal' 'Congo' 'Mozambique' 'South Africa' 'Togo' 'Benin'
 'Belize' 'Suriname' 'Thailand' 'Nigeria' 'Mauritania' 'Vanuatu' 'Panama'
 'Virgin Islands' 'Saint Vincent and the Grenadines'
 "Lao People's Democratic Republic" 'Myanmar (Burma)' 'Malawi' 'Moldova'
 'South Sudan' 'Solomon Islands' 'China' 'Egypt' 'Guam' 'Afghanistan'
 'Madagascar' 'Namibia' 'Puerto Rico' 'Lesotho' "Cote D'Ivoire" 'Bhutan']
87

In [24]:
print(data.sector.unique())
print(data.sector.nunique())

['Food' 'Transportation' 'Arts' 'Services' 'Agriculture' 'Manufacturing'
 'Wholesale' 'Retail' 'Clothing' 'Construction' 'Health' 'Education'
 'Personal Use' 'Housing' 'Entertainment']
15

In [25]:
#Because Food and Agriculture are directly related, I have changed them to one: Agriculture
data.loc[data['sector'] == 'Food', 'sector'] = 'Agriculture'
data.sector.unique()

array(['Agriculture', 'Transportation', 'Arts', 'Services',
       'Manufacturing', 'Wholesale', 'Retail', 'Clothing', 'Construction',
       'Health', 'Education', 'Personal Use', 'Housing', 'Entertainment'],
      dtype=object)

#Testing hypothesis towards finding out about the borrowers in Kiva.
1.Who are they?-Gender.
2.What do they do?-Sector
3.Where do they come from?-Country
4.How long have they borrowed?-term in months
5.How do they pay? Poverty levels? -repayment intervals
6.Which country borrows the most or the least? & In which sector?

1.What is the gender of most borrowers in Kiva?

My hypothesis is that most borrowers in Kiva are female.

In [26]:
borrower_genders = data['gender'].value_counts()
print(borrower_genders)

F    528461
M    138523
Name: gender, dtype: int64

In [27]:
female_borrowers = int(528461)
male_borrowers = int(138523)
total_borrowers = female_borrowers + male_borrowers
print('The female borrowers are: {:.0%}'.format(female_borrowers /total_borrowers))
print('The male borrowers are: {:.0%}'.format(male_borrowers /total_borrowers))

The female borrowers are: 79%
The male borrowers are: 21%

2.In which sector are the female and male genders involved in respectively?

My hypothesis is that most female are in the Agriculture sector, and male in the Transportation sector.

In [28]:
female_data = data[data['gender'] == 'F']
male_data = data[data['gender'] == 'M']
female_data.head(5)
#male_data.sample(10)

,id,loan_amount,sector,country,term_in_months,repayment_interval,date,gender
0,653051,300.0,Agriculture,Pakistan,12.0,irregular,2014-01-01,F
1,653053,575.0,Transportation,Pakistan,11.0,irregular,2014-01-01,F
2,653068,150.0,Transportation,India,43.0,bullet,2014-01-01,F
3,653063,200.0,Arts,Pakistan,11.0,irregular,2014-01-01,F
4,653084,400.0,Agriculture,Pakistan,14.0,monthly,2014-01-01,F

In [29]:
female_data['sector'].value_counts()

Agriculture       250078
Retail            109244
Services           34512
Clothing           29752
Personal Use       27580
Housing            25177
Education          19008
Arts               10758
Transportation      8521
Health              6203
Manufacturing       3799
Construction        3047
Entertainment        424
Wholesale            358
Name: sector, dtype: int64

Most female borrowers are in the Agriculture sector.

In [30]:
print('The sector with the most amount of loan borrowed:', data.groupby('sector')['loan_amount'].sum().idxmax())
print('The highest loan amount borrowed per sector:{:.0f}'.format(data.groupby('sector')['loan_amount'].sum().max()))

The sector with the most amount of loan borrowed: Agriculture
The highest loan amount borrowed per sector:262627050

In [31]:
male_data['sector'].value_counts()

Agriculture       64895
Retail            14514
Education         11829
Services          10187
Personal Use       8667
Housing            8394
Transportation     6934
Construction       3147
Health             2969
Clothing           2728
Manufacturing      2359
Arts               1236
Entertainment       396
Wholesale           268
Name: sector, dtype: int64

Most male borrowers are also in the Agriculture sector.

3. In which country do most borrowers come from?

In [39]:
country_grouped = data.groupby('country').agg({'gender': ['value_counts']})
country_grouped.head(5)

                         gender
                   value_counts
country     gender
Afghanistan F                 2
Albania     F              1018
            M               899
Armenia     F              5383
            M              3245

In [56]:
print(country_grouped['gender'].idxmin(), country_grouped['gender'].min())

value_counts    (Bhutan, F)
dtype: object value_counts    1
dtype: int64

In [57]:
print(country_grouped['gender'].idxmax(), country_grouped['gender'].max())

value_counts    (Philippines, F)
dtype: object value_counts    151984
dtype: int64

The highest country borrrower is Phillipines. In Phillippines, the female gender borrows the most.
The lowest country borrower is Bhutan. With one female borrower.

Why Phillipines? Is Kiva a Phillipines' company? Have more financial campaigns been done in Phillipines?

4. How long have they borrowed?
Which is the longest borrowing gender?
Which is the longest borrowing country?